## EDA을 위한 다양한 pandas function 연습  
---
참고링크 : https://pandas.pydata.org/docs/user_guide/10min.html  
한글 : https://dandyrilla.github.io/2017-08-12/pandas-10min/

API ref : https://pandas.pydata.org/docs/reference/index.html

In [1]:
import numpy as np
import pandas as pd

### series and dataFrame 

차이점을 기억해 두자  
series 1차 배열  
dataFrame 2차 배열  

실제 data 특성에 맞는 샘플 데이터를 만들수 있어야 한다.   
해당 샘플 데이터로 각 연산 결과를 미리 확인 할 수 있어야 한다.   
print(type()) 을 이용하여 object 의 타입을 정확히 파악해야 한다.  
( series[index_label] vs dataframe[column_label] )  
answer.ipynb 와 test.ipynb, sample.ipynb 으로 운영한다. 

```
pd.DataFrame( Serise, 
              columns = ['',''])
              index = lsit
            )

pd.DataFrame(
    { 
      'A': list
      'B': ['', '']
    },
    index=['','']
    )
```

In [2]:
pd.DataFrame({ 
    'B': ['B', 'C'],
}, index= [1,2])

   B
1  B
2  C

In [3]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [4]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
# df 만드든 방법 1

df = pd.DataFrame(np.random.randn(6, 4),
                   index=dates, 
                   columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126
2013-01-03 -2.182360  0.878224 -0.465266  0.308803
2013-01-04  1.818816  0.013482  0.394500  1.986610
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452
2013-01-06 -0.441746  0.012684  1.238640 -0.153800

In [6]:
S = df.A
S[1:]   # silicing

S[1]  # serise indexiting
S[S>1] # serise masking

2013-01-04    1.818816
Freq: D, Name: A, dtype: float64

In [7]:

D = df[['A','B']]

D[1:]   # df slicing
# D[1]    # indexing 은 오류
D[D>1]

                   A   B
2013-01-01       NaN NaN
2013-01-02       NaN NaN
2013-01-03       NaN NaN
2013-01-04  1.818816 NaN
2013-01-05       NaN NaN
2013-01-06       NaN NaN

dataFrame :   
DataFrame은 2차원 배열 데이터라고 이해하는 것보다 공통 인덱스를 가진 column series를 딕셔너리로 묶어놓은 것

In [8]:
# df 만드는 방법 2 

df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

df2 
# df2[:]
# df2[:][:]
# df2.loc[:,:]

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

### 2. Viewing Data

In [9]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [10]:
print(df.head(2),'\n')

print(df.tail(2), '\n')

print(df.index, '\n')

print(df.columns, '\n')

df.describe()

                   A         B         C         D
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126

                   A         B         C         D
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452
2013-01-06 -0.441746  0.012684  1.238640 -0.153800

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

Index(['A', 'B', 'C', 'D'], dtype='object')

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.481760 -0.195227 -0.490164  0.351651
std    1.427232  0.726484  1.357099  0.994128
min   -2.182360 -1.050852 -2.805236 -0.915031
25%   -1.386635 -0.753919 -0.707438 -0.115382
50%   -0.658714 -0.008414 -0.502912  0.154338
75%    0.150089  0.013283  0.179559  0.739790
max    1.818816  0.878224  1.238640  1.986610

In [11]:
# 행, 열을 바꾼다. 

df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.875682    0.347367   -2.182360    1.818816   -1.556952   -0.441746
B   -0.995388   -0.029513    0.878224    0.013482   -1.050852    0.012684
C   -0.540558   -2.805236   -0.465266    0.394500   -0.763064    1.238640
D   -0.915031   -0.000126    0.308803    1.986610    0.883452   -0.153800

In [12]:
df.to_numpy()

array([[-8.75681538e-01, -9.95387578e-01, -5.40558146e-01,
        -9.15030685e-01],
       [ 3.47366983e-01, -2.95125232e-02, -2.80523568e+00,
        -1.26202741e-04],
       [-2.18236039e+00,  8.78223933e-01, -4.65266422e-01,
         3.08802525e-01],
       [ 1.81881599e+00,  1.34824558e-02,  3.94500373e-01,
         1.98661049e+00],
       [-1.55695234e+00, -1.05085163e+00, -7.63064487e-01,
         8.83451873e-01],
       [-4.41745727e-01,  1.26840216e-02,  1.23863961e+00,
        -1.53800284e-01]])

In [13]:
df.select_dtypes(include='int64')

Empty DataFrame
Columns: []
Index: [2013-01-01 00:00:00, 2013-01-02 00:00:00, 2013-01-03 00:00:00, 2013-01-04 00:00:00, 2013-01-05 00:00:00, 2013-01-06 00:00:00]

In [14]:
df.select_dtypes(include='number')

                   A         B         C         D
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126
2013-01-03 -2.182360  0.878224 -0.465266  0.308803
2013-01-04  1.818816  0.013482  0.394500  1.986610
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452
2013-01-06 -0.441746  0.012684  1.238640 -0.153800

value_counts()

df.value_counts()   : 1 이상이면 동일한 row 존재  (전부 1이면, 다 값이 다르고, 실재 row 갯수 만큼 나온다.)  
series.value_counts() : 1 이상이면 동일한 값 존재

### 3. Selection 

df[1] : 인텍싱  '정수일때만 가능 (df[df.index == 1] 가 같음), 주로 df 'column' 선택에 사용  
df[2:4] : 슬라이싱  
df[df>1] : 마스킹  

=> 주로 Serise 을 사용할때 사용한다고 생각하자. series[1] / series[2:4] / serise[serise>1]

.             : ```df.col```  
[]            : ```df[column]```         , * df[row_lable: ] 은 사용하지 말자.  
loc (or at)   : df.loc[index_lable,] 은 조건일때만 사용     , ```df.loc[ : , col_label]```    
iloc (or iat) : ```df.iloc[몇번째 row]``` , df.iloc[ : , 몇번째 col]

In [15]:
print(df['A'],'\n')
print(df[:]['A'],'\n')              #df.loc[:,'A']
# df['2013-01-01':]['A']            # chained indexing ?
# df.A

## column 을 선택하게 되며 series 로 리턴된다.


print(df[['A']],'\n')               # df 으로 리턴 
df[['A','C']]                       # dataFrame 리턴

## 2개 이상, 이거나 [[ 'col' ]] 으로 1개 col 을 df 로 리턴

2013-01-01   -0.875682
2013-01-02    0.347367
2013-01-03   -2.182360
2013-01-04    1.818816
2013-01-05   -1.556952
2013-01-06   -0.441746
Freq: D, Name: A, dtype: float64

2013-01-01   -0.875682
2013-01-02    0.347367
2013-01-03   -2.182360
2013-01-04    1.818816
2013-01-05   -1.556952
2013-01-06   -0.441746
Freq: D, Name: A, dtype: float64

                   A
2013-01-01 -0.875682
2013-01-02  0.347367
2013-01-03 -2.182360
2013-01-04  1.818816
2013-01-05 -1.556952
2013-01-06 -0.441746

                   A         C
2013-01-01 -0.875682 -0.540558
2013-01-02  0.347367 -2.805236
2013-01-03 -2.182360 -0.465266
2013-01-04  1.818816  0.394500
2013-01-05 -1.556952 -0.763064
2013-01-06 -0.441746  1.238640

In [16]:
# 오류 

# print(df[0],'\n')                # 명시적 인덱스 0 을 찾기때문에 오류
# print(df['2013-01-01'],'\n')     # column 에서 찾기 때문에 오류 
print(df['2013-01-01':'2013-01-02'],'\n')  # 근데 이건 됨... 헐.
print(df[:'2013-01-02'],'\n')

                   A         B         C         D
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126

                   A         B         C         D
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126

In [17]:
# df[0:3]
# df['2013-01-01':'2013-01-03']
print(df['2013-01-04':], '\n')
print(df['2013-01-04':'2013-01-04'], '\n')     # 3, 4 열, label 은 끝 포함
print(df[3:4], '\n')                           # 3열만, index 은 -1 까지
df[3:]

# row 을 선택하게 되며, dataFrame 으로 리턴된다

                   A         B         C         D
2013-01-04  1.818816  0.013482  0.394500  1.986610
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452
2013-01-06 -0.441746  0.012684  1.238640 -0.153800

                   A         B       C        D
2013-01-04  1.818816  0.013482  0.3945  1.98661

                   A         B       C        D
2013-01-04  1.818816  0.013482  0.3945  1.98661

                   A         B         C         D
2013-01-04  1.818816  0.013482  0.394500  1.986610
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452
2013-01-06 -0.441746  0.012684  1.238640 -0.153800

In [18]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [19]:
print(df2[:3])  # 이런 형태는 사용하지 말자.  3번째 까지, column 이랑 혼동된다.
# df2.iloc[,:3] 3번째 columns 까지 인건지, df2.iloc[:3,] 3번째 row 인건지??

print(df2.loc[:3,])  # 이것도 사용하지 말자.  3번 까지 , 3번이 어디있을줄 알고... 
# 정수형이 아니면 df.loc[:'서울',] 이건 괜찬을듯.

df2.iloc[:3,]   # 이걸 사용하자. 3번째 까지

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo

In [20]:
#chained indexing?
print(df2[2:4]['A'],'\n')     # row / col
print(df2[2:4][0:4], '\n')     # row seriese 의 row serise
df2[2:4][0:1]                 # 2,3 row 로 만들어진 것에서 다시 0,1 row 첫번째

2    1.0
3    1.0
Name: A, dtype: float64

     A          B    C  D      E    F
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

     A          B    C  D     E    F
2  1.0 2013-01-02  1.0  3  test  foo

In [21]:
df2.iloc[0]     # 암묵적 인덱스 0 번째 선택

A                    1.0
B    2013-01-02 00:00:00
C                    1.0
D                      3
E                   test
F                    foo
Name: 0, dtype: object

In [22]:
df2.loc[2]        # 명시적 인덱스 2 선택

A                    1.0
B    2013-01-02 00:00:00
C                    1.0
D                      3
E                   test
F                    foo
Name: 2, dtype: object

Row

df.shape[0] = row 행갯수

df.iloc[몇번째 row,]  
df.loc[row_label,]  ```---> row_label 대신 조건절이 들어가면 조건절은 해당 row 의 index label 을 리턴한다.```

으로만 사용

In [23]:
df2.shape, df2.shape[0], df2.shape[1]

((4, 6), 4, 6)

In [24]:
# row label (명시적, 몇번) 을 이용해서 row 을 인덱싱
# index 가 int 인 경우 df.loc[index_int] 도 가능, 
print(df.loc['20130101'],'\n')              # series
print(df.loc['20130101':'20130102'],'\n')   # dataFrame
print(df.loc[['20130101','20130102']],'\n')

# row location (암묵적 , 몇번째) index 을 이용해서 row 인덱싱
print(df.iloc[0],'\n')                      # series
print(df.iloc[0:1],'\n')                    #dataFrame
print(df.iloc[[0,1]],'\n')

A   -0.875682
B   -0.995388
C   -0.540558
D   -0.915031
Name: 2013-01-01 00:00:00, dtype: float64

                   A         B         C         D
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126

                   A         B         C         D
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126

A   -0.875682
B   -0.995388
C   -0.540558
D   -0.915031
Name: 2013-01-01 00:00:00, dtype: float64

                   A         B         C         D
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031

                   A         B         C         D
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126

Column

df.shape[1] = columns 열갯수

특정 column 은 몇번째 column 인가? 는 어떻게 찾지?

```
columns 을 추가할때는 인덱스가 없는 list 형태로 입력해야 한다. 
그렇지 않으면, 인덱스가 서로 다를때 입력이 안될수 있다. 
```

In [25]:

# column lable 을 이용해서 column 인덱싱
# print(df.loc['A'],'\n')      # 'A' 을 row 인텍싱으로 생각해서 
print(df.loc[:,'A'],'\n')
print(df.loc[:, ['A']],'\n')
print(df.loc[:,'A':'B'],'\n')
print(df.loc[:,['A','B']],'\n')

2013-01-01   -0.875682
2013-01-02    0.347367
2013-01-03   -2.182360
2013-01-04    1.818816
2013-01-05   -1.556952
2013-01-06   -0.441746
Freq: D, Name: A, dtype: float64

                   A
2013-01-01 -0.875682
2013-01-02  0.347367
2013-01-03 -2.182360
2013-01-04  1.818816
2013-01-05 -1.556952
2013-01-06 -0.441746

                   A         B
2013-01-01 -0.875682 -0.995388
2013-01-02  0.347367 -0.029513
2013-01-03 -2.182360  0.878224
2013-01-04  1.818816  0.013482
2013-01-05 -1.556952 -1.050852
2013-01-06 -0.441746  0.012684

                   A         B
2013-01-01 -0.875682 -0.995388
2013-01-02  0.347367 -0.029513
2013-01-03 -2.182360  0.878224
2013-01-04  1.818816  0.013482
2013-01-05 -1.556952 -1.050852
2013-01-06 -0.441746  0.012684

In [26]:
df.head()

                   A         B         C         D
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126
2013-01-03 -2.182360  0.878224 -0.465266  0.308803
2013-01-04  1.818816  0.013482  0.394500  1.986610
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452

In [27]:

# column locatin (몇번째) index 을 이용해서 column 인덱싱
print(df.iloc[0],'\n')          # 0 을 row 인텍싱으로 생각해서 0번째 location row 을 인텍싱
print(df.iloc[:,0],'\n')        # 0 번째 column series 리턴
print(df.iloc[:,[0]])           # 0 번째 column df 리턴

A   -0.875682
B   -0.995388
C   -0.540558
D   -0.915031
Name: 2013-01-01 00:00:00, dtype: float64

2013-01-01   -0.875682
2013-01-02    0.347367
2013-01-03   -2.182360
2013-01-04    1.818816
2013-01-05   -1.556952
2013-01-06   -0.441746
Freq: D, Name: A, dtype: float64

                   A
2013-01-01 -0.875682
2013-01-02  0.347367
2013-01-03 -2.182360
2013-01-04  1.818816
2013-01-05 -1.556952
2013-01-06 -0.441746

In [28]:
print(df.iloc[:,0:2],'\n')

                   A         B
2013-01-01 -0.875682 -0.995388
2013-01-02  0.347367 -0.029513
2013-01-03 -2.182360  0.878224
2013-01-04  1.818816  0.013482
2013-01-05 -1.556952 -1.050852
2013-01-06 -0.441746  0.012684

In [29]:
print(df.iloc[:,[0,1,3]],'\n')

                   A         B         D
2013-01-01 -0.875682 -0.995388 -0.915031
2013-01-02  0.347367 -0.029513 -0.000126
2013-01-03 -2.182360  0.878224  0.308803
2013-01-04  1.818816  0.013482  1.986610
2013-01-05 -1.556952 -1.050852  0.883452
2013-01-06 -0.441746  0.012684 -0.153800

In [30]:
df.rename({'A':'a'},axis=1)

                   a         B         C         D
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126
2013-01-03 -2.182360  0.878224 -0.465266  0.308803
2013-01-04  1.818816  0.013482  0.394500  1.986610
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452
2013-01-06 -0.441746  0.012684  1.238640 -0.153800

In [31]:
df.add_suffix('_S')

                 A_S       B_S       C_S       D_S
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126
2013-01-03 -2.182360  0.878224 -0.465266  0.308803
2013-01-04  1.818816  0.013482  0.394500  1.986610
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452
2013-01-06 -0.441746  0.012684  1.238640 -0.153800

In [32]:
df.loc[::-1]   # row 순서 역순

                   A         B         C         D
2013-01-06 -0.441746  0.012684  1.238640 -0.153800
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452
2013-01-04  1.818816  0.013482  0.394500  1.986610
2013-01-03 -2.182360  0.878224 -0.465266  0.308803
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031

In [33]:
df.loc[:,::-1]  # column 역순

                   D         C         B         A
2013-01-01 -0.915031 -0.540558 -0.995388 -0.875682
2013-01-02 -0.000126 -2.805236 -0.029513  0.347367
2013-01-03  0.308803 -0.465266  0.878224 -2.182360
2013-01-04  1.986610  0.394500  0.013482  1.818816
2013-01-05  0.883452 -0.763064 -1.050852 -1.556952
2013-01-06 -0.153800  1.238640  0.012684 -0.441746

Chained indexing

In [34]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [35]:
df2.loc[0:2,'A']

0    1.0
1    1.0
2    1.0
Name: A, dtype: float64

In [36]:
print(df2.loc[[0,1],['A','B']])    # 숫자가 lable 이다 df[[0,1]] 은 오류
print(df2.iloc[[0,1],[0,1]])

     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02
     A          B
0  1.0 2013-01-02
1  1.0 2013-01-02

In [37]:
df

                   A         B         C         D
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126
2013-01-03 -2.182360  0.878224 -0.465266  0.308803
2013-01-04  1.818816  0.013482  0.394500  1.986610
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452
2013-01-06 -0.441746  0.012684  1.238640 -0.153800

In [38]:
df[2:6][df[2:6].A < 0][1:2]

# df 의 2부터 6 row 중 A column  값이 0 보다 작은 두번재 row

                   A         B         C         D
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452

In [39]:
print(df[2:6])
print(df[2:6].A<0)

# 2개의 index가 같아야 한다. 
# IndexingError: Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

                   A         B         C         D
2013-01-03 -2.182360  0.878224 -0.465266  0.308803
2013-01-04  1.818816  0.013482  0.394500  1.986610
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452
2013-01-06 -0.441746  0.012684  1.238640 -0.153800
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06     True
Freq: D, Name: A, dtype: bool

Boolean indexing

```(df[])[(df[]) 조건][column]```  
```(df[]).loc[ (df[]) 조건 , column ]```

iloc 는 boolean index 을 사용할 수 없다.  
iLocation based boolean indexing on an integer type is not available

In [40]:
df[df['A']>0]['B']

2013-01-02   -0.029513
2013-01-04    0.013482
Freq: 2D, Name: B, dtype: float64

In [41]:
df.loc[df['A']>0,'B']

2013-01-02   -0.029513
2013-01-04    0.013482
Freq: 2D, Name: B, dtype: float64

In [42]:
print(df[1:3].A > 0)  # 이거 대신
df.iloc[1:3].A > 0   # 이걸 사용하자

2013-01-02     True
2013-01-03    False
Freq: D, Name: A, dtype: bool

2013-01-02     True
2013-01-03    False
Freq: D, Name: A, dtype: bool

In [43]:
df.iloc[1:3][df.iloc[1:3].A >0]

                   A         B         C         D
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126

In [44]:
df[1:3][df[1:3].A > 0]   # chained indexing ???

                   A         B         C         D
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126

In [45]:
# df[df[1:3].A > 0]  은 오류가 난다.  df 의 index 와 df[1:3] 의 index 가 서로 맞지않다.
# 조건에 대한 true 값의 index label '2013-01-02' 을 리턴한다.
# 따라서 df['2013-01-02'] 가 오류

df[1:3].A > 0

2013-01-02     True
2013-01-03    False
Freq: D, Name: A, dtype: bool

In [46]:
# Unalignable boolean Series provided as indexer (index of the boolean Series and of the indexed object do not match).

# df.loc[df[1:3].A > 0] 
df[1:3].loc[df[1:3].A >0]

                   A         B         C         D
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126

In [47]:
df[1:3][df[0:4].A  > 0]['B']

/var/folders/yn/xbyfmttd1tdc740qcs27ft9m0000gn/T/ipykernel_1367/1907405889.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df[1:3][df[0:4].A  > 0]['B']

2013-01-02   -0.029513
Freq: D, Name: B, dtype: float64

In [48]:
#  UserWarning: Boolean Series key will be reindexed to match DataFrame index. 해결방법 

X = df[1:3]
X[X[0:4].A > 0]['B']

2013-01-02   -0.029513
Freq: D, Name: B, dtype: float64

In [49]:
df[1:3][df[1:3].A > 0]['B']
# df1 = df[1:3]
# df1.A > 0
# df1['B']

2013-01-02   -0.029513
Freq: D, Name: B, dtype: float64

funtion indexing

```
pipe()  : Tablewise Function Application
apply() : Row or Column-wise Function Application (df 적용, 행/열 전달. groupby 적용 그룹 전달)
agg() and transform() : Aggregation API
map() : Series 에서 값에 적용한다. (Series 적용, 값 전달)
applymap() : Applying Elementwise Functions  (df 적용, 값을 전달)

pd.cut()    : 조건에 따른 구간별 label  (pd.qcut() : 균등분할)
np.where()  : 조건에 따른 값표시 (아닌값은 NaN)
```

In [50]:
df

                   A         B         C         D
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126
2013-01-03 -2.182360  0.878224 -0.465266  0.308803
2013-01-04  1.818816  0.013482  0.394500  1.986610
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452
2013-01-06 -0.441746  0.012684  1.238640 -0.153800

In [51]:
df3 = df.copy()
df3['sum_row'] = df3.apply(np.sum,axis=1)    # df3.sum(axis=1) 과 같다.
df3

                   A         B         C         D   sum_row
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031 -3.326658
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126 -2.487507
2013-01-03 -2.182360  0.878224 -0.465266  0.308803 -1.460600
2013-01-04  1.818816  0.013482  0.394500  1.986610  4.213409
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452 -2.487417
2013-01-06 -0.441746  0.012684  1.238640 -0.153800  0.655778

In [52]:
# 전체 row 을 순회 (axis =1) 해서 row 갯수 크기의 series 전달

df3["result"] = df3.apply(lambda r: "Over" if r.sum_row > 0 else "Under", axis=1)
df3

                   A         B         C         D   sum_row result
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031 -3.326658  Under
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126 -2.487507  Under
2013-01-03 -2.182360  0.878224 -0.465266  0.308803 -1.460600  Under
2013-01-04  1.818816  0.013482  0.394500  1.986610  4.213409   Over
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452 -2.487417  Under
2013-01-06 -0.441746  0.012684  1.238640 -0.153800  0.655778   Over

In [53]:
# bins=[-100,0,100]
# labels =['under','over']      # bins 보다 하나 적은 갯수 (사이값) 이어야 한다.
pd.cut(df3.sum_row, bins=[-100,0,100], labels=['under','over'] )

2013-01-01    under
2013-01-02    under
2013-01-03    under
2013-01-04     over
2013-01-05    under
2013-01-06     over
Freq: D, Name: sum_row, dtype: category
Categories (2, object): ['under' < 'over']

In [54]:
df3 = df3.drop(columns='result')
df3

                   A         B         C         D   sum_row
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031 -3.326658
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126 -2.487507
2013-01-03 -2.182360  0.878224 -0.465266  0.308803 -1.460600
2013-01-04  1.818816  0.013482  0.394500  1.986610  4.213409
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452 -2.487417
2013-01-06 -0.441746  0.012684  1.238640 -0.153800  0.655778

In [55]:
df3.where((df3.sum_row>0) & (df3.B>0))    # boolean 으로 리턴하지 않고, 값을 리턴 하다. dropna() 을 붙일수 있다.

                   A         B        C        D   sum_row
2013-01-01       NaN       NaN      NaN      NaN       NaN
2013-01-02       NaN       NaN      NaN      NaN       NaN
2013-01-03       NaN       NaN      NaN      NaN       NaN
2013-01-04  1.818816  0.013482  0.39450  1.98661  4.213409
2013-01-05       NaN       NaN      NaN      NaN       NaN
2013-01-06 -0.441746  0.012684  1.23864 -0.15380  0.655778

In [56]:
df3[(df3.sum_row>0) & (df3.B>0)]

# dropna() 까지 한 결과

                   A         B        C        D   sum_row
2013-01-04  1.818816  0.013482  0.39450  1.98661  4.213409
2013-01-06 -0.441746  0.012684  1.23864 -0.15380  0.655778

In [57]:
# df.query  을  사용

df3.query("sum_row > 0 and B >0")

                   A         B        C        D   sum_row
2013-01-04  1.818816  0.013482  0.39450  1.98661  4.213409
2013-01-06 -0.441746  0.012684  1.23864 -0.15380  0.655778

### 4. Missing 

``` 
dropna()
fillna()
notnull()
notna()   
isnull()
isna() 
```

In [58]:
df3.where((df3.sum_row>0) & (df3.B>0)).fillna(0)

                   A         B        C        D   sum_row
2013-01-01  0.000000  0.000000  0.00000  0.00000  0.000000
2013-01-02  0.000000  0.000000  0.00000  0.00000  0.000000
2013-01-03  0.000000  0.000000  0.00000  0.00000  0.000000
2013-01-04  1.818816  0.013482  0.39450  1.98661  4.213409
2013-01-05  0.000000  0.000000  0.00000  0.00000  0.000000
2013-01-06 -0.441746  0.012684  1.23864 -0.15380  0.655778

In [59]:
# 공백 값 (셀 값이 없음) 제거 

df_sp = pd.DataFrame({
    'A': range(6),
    'B': ['foo', '', 'bar', '', np.nan, 'xyz']
})
df_sp

   A    B
0  0  foo
1  1
2  2  bar
3  3
4  4  NaN
5  5  xyz

In [60]:
# unique() 로 공백을 확인 할 수 있다. 

df_sp['B'].unique()

array(['foo', '', 'bar', nan, 'xyz'], dtype=object)

In [61]:
# 공백('') 을 np.nan 으로 변경 

df_sp['B'] = df_sp['B'].replace('',np.nan)
df_sp['B'].unique()

array(['foo', nan, 'bar', 'xyz'], dtype=object)

### 5. Operations

```
sum, mean, std, var
sort, count
apply
str
```

In [62]:
print(df.sort_index())
print(df.sort_values('A'),'\n')
# df.sort_values(by='A')
print(df.sort_values(by= ['A','B'],ascending=False))

                   A         B         C         D
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126
2013-01-03 -2.182360  0.878224 -0.465266  0.308803
2013-01-04  1.818816  0.013482  0.394500  1.986610
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452
2013-01-06 -0.441746  0.012684  1.238640 -0.153800
                   A         B         C         D
2013-01-03 -2.182360  0.878224 -0.465266  0.308803
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-06 -0.441746  0.012684  1.238640 -0.153800
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126
2013-01-04  1.818816  0.013482  0.394500  1.986610

                   A         B         C         D
2013-01-04  1.818816  0.013482  0.394500  1.986610
2013-01-02  0.347367 -0.029513 -2.805236 -0.000126
2013-01-06 -0.441746  0.012684  1.238640 -0.153800
2013-01-01 -0.875682 -0.995388 -0.540558 -0.915031
2013-01-05 -1.556952 -1.050852 -0.763064  0.883452
2013-01-03 -2.182360  0.878224 -0.465266  0.308803

In [63]:
print(df.sum())          # row 들의 합 (col : 합) axis=0 디폴트
print(df.sum(axis=1))    # column 들의 함 (row : 합) axis=1

A   -2.890557
B   -1.171361
C   -2.940985
D    2.109908
dtype: float64
2013-01-01   -3.326658
2013-01-02   -2.487507
2013-01-03   -1.460600
2013-01-04    4.213409
2013-01-05   -2.487417
2013-01-06    0.655778
Freq: D, dtype: float64

### 6. Merging

```
concat
join
merge
```

### 7. Grouping

```
Splitting the data into groups based on some criteria
Applying a function to each group independently
Combining the results into a data structure

1. 새로운 df (groupby index) 을 생성할 것인가? 

2. 기존 df 에서 groupby 로 계산한 후, 업데이트 할 것인가?
Groupby 로 새로운 인덱스가 생성이되므로, 
apply 로 인해 각 row 별로 계산된 값은 
groupby 로 생성된 인덱스를 삭제하고,
gorupby 로 sort 된것을 기존 인덱스를 이용해 복구 해야 한다. 

=> group 화 대이상 2개 이하이며 추가 조건이 있는 경우,for 구문으로 구현하는 것이 좋을것 같음

```

In [64]:
df_g = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)

df_g

     A      B         C         D
0  foo    one -0.617410  1.337921
1  bar    one -0.627590 -0.706571
2  foo    two -0.624132  0.201705
3  bar  three -0.569376 -0.411965
4  foo    two -1.106307  0.895020
5  bar    two  0.158905  1.637154
6  foo    one -0.294452 -0.214003
7  foo  three -0.449825 -0.037738

df.groupby().apply(list)

df.groupby().groups.keys()

In [86]:
df_g.groupby(['A','B'])['C'].apply(list)

A    B
bar  one                           [-0.6275898712578964]
     three                         [-0.5693760884480542]
     two                            [0.1589053677070462]
foo  one      [-0.6174104616720603, -0.2944519220320683]
     three                         [-0.4498251251261912]
     two       [-0.6241317330542928, -1.106307287155951]
Name: C, dtype: object

In [99]:
df_g.groupby(['A','B'])['C'].groups.keys()

dict_keys([('bar', 'one'), ('bar', 'three'), ('bar', 'two'), ('foo', 'one'), ('foo', 'three'), ('foo', 'two')])

In [102]:
df_g.groupby(['A','B'])['C'].ngroup()

# 각 row 들이 어떻게 groupping 되는가.
# 0 3 : index 0 은 3번 그룹으로 묶임
# df['groupN'] = df.groupby().ngroup()  을 생성해서 몇개 그룹이 만들어 지고, 어떻게 구성되는지 알수 있다.

0    3
1    0
2    5
3    1
4    5
5    2
6    3
7    4
dtype: int64

In [98]:
for key, group in df_g.groupby(['A','B'])['C']:
    print(key, group)

('bar', 'one') 1   -0.62759
Name: C, dtype: float64
('bar', 'three') 3   -0.569376
Name: C, dtype: float64
('bar', 'two') 5    0.158905
Name: C, dtype: float64
('foo', 'one') 0   -0.617410
6   -0.294452
Name: C, dtype: float64
('foo', 'three') 7   -0.449825
Name: C, dtype: float64
('foo', 'two') 2   -0.624132
4   -1.106307
Name: C, dtype: float64

In [97]:
for key, group in df_g.groupby(['A','B']):
    print(key,group)

('bar', 'one')      A    B        C         D
1  bar  one -0.62759 -0.706571
('bar', 'three')      A      B         C         D
3  bar  three -0.569376 -0.411965
('bar', 'two')      A    B         C         D
5  bar  two  0.158905  1.637154
('foo', 'one')      A    B         C         D
0  foo  one -0.617410  1.337921
6  foo  one -0.294452 -0.214003
('foo', 'three')      A      B         C         D
7  foo  three -0.449825 -0.037738
('foo', 'two')      A    B         C         D
2  foo  two -0.624132  0.201705
4  foo  two -1.106307  0.895020

multi-index

In [630]:
df_g.groupby(['A','B'])[['C']].size().xs(('bar','one'),level=(0,1))

A    B
bar  one    1
dtype: int64

In [631]:
df_g.groupby(['A','B'])[['C']].size().xs(('one'),level=(1))

A
bar    1
foo    2
dtype: int64

[].reset_index / [[]].reset_index

In [632]:
df_g.groupby(['A','B'])['C'].value_counts()

# df_g.groupby(['A','B'])['C'].value_counts().reset_index() 는 오류발생. ('C' 가 중복된다. )
# new_df_g = df_g.groupby(['A','B'])['C'].value_counts()
# new_df_g.name = C_count
# new_df_g.reset_index()

A    B      C
bar  one     0.799757    1
     three  -1.129951    1
     two    -0.321869    1
foo  one     0.722692    1
             1.884121    1
     three   0.217999    1
     two    -0.479883    1
             0.465942    1
Name: count, dtype: int64

In [633]:
# [[C]] 은 데이터 프레임이라서 reset_index 가 가능하다. 
# groupby 로 인텍스화 되었던 A,B 가 columns 으로 재 배치 되고, 
# A B 의 unique 한 조합으로 새로운 df index 이 생성됨.
# 기존 8x4 -> 6x3

df_g2 = df_g.groupby(['A','B'])[['C']].sum().reset_index()
df_g2

     A      B         C
0  bar    one  0.799757
1  bar  three -1.129951
2  bar    two -0.321869
3  foo    one  2.606813
4  foo  three  0.217999
5  foo    two -0.013941

groupby().apply(funcX)

In [90]:
df_g.groupby(['A','B']).apply(list)

# 전달되는 index 와 columns, 즉 df 을 볼수 있다.

A    B
bar  one      [A, B, C, D]
     three    [A, B, C, D]
     two      [A, B, C, D]
foo  one      [A, B, C, D]
     three    [A, B, C, D]
     two      [A, B, C, D]
dtype: object

In [634]:
# 6개 유닉크한 AB groupby 의 그룹 key 값이 전달된다.

def funX(groupbyKey : pd.DataFrame.groupby) -> pd.DataFrame.groupby:
    print(groupbyKey)
    groupbyKey['C'] =  groupbyKey['C'].sum()
    print(groupbyKey)

    return groupbyKey

newG = df_g.groupby(['A','B']).apply(funX)
newG

# groupby 기준으로 index 가 생성이되고, 기존 index 는 level=2 가 추가된 multi_index df 가 생성됨.
# 기존 df 형태로 되돌리기 위해서는 
# groupby 로 생성된 index 0, 1을 삭제하여 기존 인덱스를 살리고, groupby 로 sort 되었던것을 기존 인덱스로 재 sort 해야함
# .reset_index(drop=True, level=(0,1)).sort_index()   
# 을 해주어야 함.

     A    B         C         D
1  bar  one  0.799757 -0.890684
     A    B         C         D
1  bar  one  0.799757 -0.890684
     A      B         C         D
3  bar  three -1.129951 -0.339948
     A      B         C         D
3  bar  three -1.129951 -0.339948
     A    B         C         D
5  bar  two -0.321869 -0.775405
     A    B         C         D
5  bar  two -0.321869 -0.775405
     A    B         C         D
0  foo  one  1.884121 -0.030442
6  foo  one  0.722692 -0.480097
     A    B         C         D
0  foo  one  2.606813 -0.030442
6  foo  one  2.606813 -0.480097
     A      B         C         D
7  foo  three  0.217999  0.376879
     A      B         C         D
7  foo  three  0.217999  0.376879
     A    B         C         D
2  foo  two -0.479883 -0.892886
4  foo  two  0.465942 -1.673656
     A    B         C         D
2  foo  two -0.013941 -0.892886
4  foo  two -0.013941 -1.673656

               A      B         C         D
A   B
bar one   1  bar    one  0.799757 -0.890684
    three 3  bar  three -1.129951 -0.339948
    two   5  bar    two -0.321869 -0.775405
foo one   0  foo    one  2.606813 -0.030442
          6  foo    one  2.606813 -0.480097
    three 7  foo  three  0.217999  0.376879
    two   2  foo    two -0.013941 -0.892886
          4  foo    two -0.013941 -1.673656

In [635]:
newG.reset_index(drop=True,level=(0,1)).sort_index()

# groupby 로 계산을 하고, 원래 8x4 형태로 되돌아 옴.
# 기존 (groupby 이전) df 에 계산된 값을 업데이트 할 수 있음.

     A      B         C         D
0  foo    one  2.606813 -0.030442
1  bar    one  0.799757 -0.890684
2  foo    two -0.013941 -0.892886
3  bar  three -1.129951 -0.339948
4  foo    two -0.013941 -1.673656
5  bar    two -0.321869 -0.775405
6  foo    one  2.606813 -0.480097
7  foo  three  0.217999  0.376879

In [636]:
def funX(groupbyKey : pd.DataFrame.groupby) -> pd.Series.groupby:
    print(groupbyKey)
    groupbyKey = groupbyKey.sum()
    print(groupbyKey)  # 전체 columns 의 sum 결과인 Series
    # groupbyKey = groupbyKey+1  # 은 받은 DataFrame.groupby 을 리턴한다.
    return groupbyKey

df_g.groupby(['A','B']).apply(funX)

# A,B str 까지 sum 됨.

     A    B         C         D
1  bar  one  0.799757 -0.890684
A         bar
B         one
C    0.799757
D   -0.890684
dtype: object
     A      B         C         D
3  bar  three -1.129951 -0.339948
A         bar
B       three
C   -1.129951
D   -0.339948
dtype: object
     A    B         C         D
5  bar  two -0.321869 -0.775405
A         bar
B         two
C   -0.321869
D   -0.775405
dtype: object
     A    B         C         D
0  foo  one  1.884121 -0.030442
6  foo  one  0.722692 -0.480097
A      foofoo
B      oneone
C    2.606813
D   -0.510539
dtype: object
     A      B         C         D
7  foo  three  0.217999  0.376879
A         foo
B       three
C    0.217999
D    0.376879
dtype: object
     A    B         C         D
2  foo  two -0.479883 -0.892886
4  foo  two  0.465942 -1.673656
A      foofoo
B      twotwo
C   -0.013941
D   -2.566541
dtype: object

                A       B         C         D
A   B
bar one       bar     one  0.799757 -0.890684
    three     bar   three -1.129951 -0.339948
    two       bar     two -0.321869 -0.775405
foo one    foofoo  oneone  2.606813 -0.510539
    three     foo   three  0.217999  0.376879
    two    foofoo  twotwo -0.013941 -2.566541

In [91]:
df_g.groupby(['A','B'])['C'].apply(list)

# 전달되는 index 와 C columns, 즉 series 을 볼수 있다.

A    B
bar  one                           [-0.6275898712578964]
     three                         [-0.5693760884480542]
     two                            [0.1589053677070462]
foo  one      [-0.6174104616720603, -0.2944519220320683]
     three                         [-0.4498251251261912]
     two       [-0.6241317330542928, -1.106307287155951]
Name: C, dtype: object

In [637]:
# 6개 유닉크한 AB 조합의 C (Series)가 전달됨 (bar,one) 부터 (foo,two)까지

def funX(g_SE : pd.Series.groupby) -> pd.Series.values:
    print(g_SE)
    g_SE = g_SE.sum()
    print(g_SE)
    return g_SE

df_g.groupby(['A','B'])['C'].apply(funX)

# funX 에서는 series을 다뤄야 한다.

1    0.799757
Name: (bar, one), dtype: float64
0.7997565945110333
3   -1.129951
Name: (bar, three), dtype: float64
-1.129951358778153
5   -0.321869
Name: (bar, two), dtype: float64
-0.3218688722206534
0    1.884121
6    0.722692
Name: (foo, one), dtype: float64
2.6068129195317677
7    0.217999
Name: (foo, three), dtype: float64
0.21799937026690452
2   -0.479883
4    0.465942
Name: (foo, two), dtype: float64
-0.013941072403078736

A    B
bar  one      0.799757
     three   -1.129951
     two     -0.321869
foo  one      2.606813
     three    0.217999
     two     -0.013941
Name: C, dtype: float64

In [638]:
def funX(groupbyKey :pd.DataFrame.groupby) -> pd.Series.values :
    print(groupbyKey)
    g_SE =  groupbyKey['C'].sum()       # 전달 받은 groupby 별 C 컬럼들 의 sum  : groupby 갯수만큼 리턴
    print(g_SE)
    return g_SE

df_g.groupby(['A','B']).apply(funX)

     A    B         C         D
1  bar  one  0.799757 -0.890684
0.7997565945110333
     A      B         C         D
3  bar  three -1.129951 -0.339948
-1.129951358778153
     A    B         C         D
5  bar  two -0.321869 -0.775405
-0.3218688722206534
     A    B         C         D
0  foo  one  1.884121 -0.030442
6  foo  one  0.722692 -0.480097
2.6068129195317677
     A      B         C         D
7  foo  three  0.217999  0.376879
0.21799937026690452
     A    B         C         D
2  foo  two -0.479883 -0.892886
4  foo  two  0.465942 -1.673656
-0.013941072403078736

A    B
bar  one      0.799757
     three   -1.129951
     two     -0.321869
foo  one      2.606813
     three    0.217999
     two     -0.013941
dtype: float64

In [639]:
def funX(g_SE : pd.Series.groupby) -> pd.Series.groupby:
    print(g_SE)
    if g_SE.shape[0] == 2:   # groupby index 에 따라 다르게 계산 
        g_SE = g_SE + 2
    else :
        g_SE = g_SE+1 
    print(g_SE)
    return g_SE  # 전달 받은 group 형태 그대로 전달한다.

myg_S = df_g.groupby(['A','B'])['C'].apply(funX)
myg_S

1    0.799757
Name: (bar, one), dtype: float64
1    1.799757
Name: (bar, one), dtype: float64
3   -1.129951
Name: (bar, three), dtype: float64
3   -0.129951
Name: (bar, three), dtype: float64
5   -0.321869
Name: (bar, two), dtype: float64
5    0.678131
Name: (bar, two), dtype: float64
0    1.884121
6    0.722692
Name: (foo, one), dtype: float64
0    3.884121
6    2.722692
Name: (foo, one), dtype: float64
7    0.217999
Name: (foo, three), dtype: float64
7    1.217999
Name: (foo, three), dtype: float64
2   -0.479883
4    0.465942
Name: (foo, two), dtype: float64
2    1.520117
4    2.465942
Name: (foo, two), dtype: float64

A    B
bar  one    1    1.799757
     three  3   -0.129951
     two    5    0.678131
foo  one    0    3.884121
            6    2.722692
     three  7    1.217999
     two    2    1.520117
            4    2.465942
Name: C, dtype: float64

In [640]:
# 동일하게 groupby 로 구성된 index 을 삭제하고, 기존 index 을 복구해야 한다. 

myg_S

A    B
bar  one    1    1.799757
     three  3   -0.129951
     two    5    0.678131
foo  one    0    3.884121
            6    2.722692
     three  7    1.217999
     two    2    1.520117
            4    2.465942
Name: C, dtype: float64

In [641]:
myg_S.reset_index(drop=True, level=(0,1)).sort_index()

# 이제야 기존 (groupby 이전) df['C'] 에 해당 값을 없데이트 할 수 있음.

0    3.884121
1    1.799757
2    1.520117
3   -0.129951
4    2.465942
5    0.678131
6    2.722692
7    1.217999
Name: C, dtype: float64

In [642]:
pd.Series([[1,3],[2]])

0    [1, 3]
1       [2]
dtype: object

In [643]:
pd.DataFrame([[1,3],[2]])

   0    1
0  1  3.0
1  2  NaN

In [644]:
df_g.groupby(['A','B'])[['C']].sum().unstack(level=0)  # B 을 는 levle = 1

              C
A           bar       foo
B
one    0.799757  2.606813
three -1.129951  0.217999
two   -0.321869 -0.013941

### 8. Reshaping

```
reshpae(-1)
stack    : index <--- columns  
unstack  : index ---> columns  
pivot table
```

In [645]:
df_g.set_index(['A','B'])[['C']]#.unstack()

# Index contains duplicate entries, cannot reshape : 'foo one' 이 중복된다. 
# df.drop_duplicates(subset=['index','column']) 으로 해결

                  C
A   B
foo one    1.884121
bar one    0.799757
foo two   -0.479883
bar three -1.129951
foo two    0.465942
bar two   -0.321869
foo one    0.722692
    three  0.217999

drop_duplicates

subset : 중복을 검사할 column 
keep: 중복값중 남길 행

df.drop ()
axis = 0/1 (행/열)     조건이 있는 경우 slicing 을 이용하자

In [646]:
# df_g2 = df_g.drop([6,2]).reset_index(drop=True) 
# A,B 열 값이 중복되는 2, 6 row을 삭제

df_g2 = df_g.drop_duplicates(subset=['A','B'],keep='first', ignore_index=True).copy()  # inplace = True 으로 원본 적용

df_g2

     A      B         C         D
0  foo    one  1.884121 -0.030442
1  bar    one  0.799757 -0.890684
2  foo    two -0.479883 -0.892886
3  bar  three -1.129951 -0.339948
4  bar    two -0.321869 -0.775405
5  foo  three  0.217999  0.376879

In [647]:
df_g2.set_index(['A','B'])[['C']].unstack()

            C
B         one     three       two
A
bar  0.799757 -1.129951 -0.321869
foo  1.884121  0.217999 -0.479883

In [648]:
df_g2.pivot(index='A',columns='B',values='C')

B         one     three       two
A
bar  0.799757 -1.129951 -0.321869
foo  1.884121  0.217999 -0.479883

pivot_table()

In [649]:
df_g2.pivot_table(index ='A',columns='B',values='C')

# pd.pivot_table(df_g2, index ='A',columns='B',values='C')

B         one     three       two
A
bar  0.799757 -1.129951 -0.321869
foo  1.884121  0.217999 -0.479883

### 9. Time Series

In [650]:
rng = pd.date_range("1/1/2012", periods=100, freq="S")

ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

ts.resample("5Min").sum()

2012-01-01    27445
Freq: 5T, dtype: int64

In [651]:
ts

2012-01-01 00:00:00    495
2012-01-01 00:00:01    487
2012-01-01 00:00:02     22
2012-01-01 00:00:03    201
2012-01-01 00:00:04    383
                      ...
2012-01-01 00:01:35    494
2012-01-01 00:01:36    281
2012-01-01 00:01:37    432
2012-01-01 00:01:38    456
2012-01-01 00:01:39    470
Freq: S, Length: 100, dtype: int64

### 10. Categroicals

### 11. Plotting